-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: localhost    Database: tutoringsys_db
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `message`
--

DROP TABLE IF EXISTS `message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `message` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `type` varchar(50) NOT NULL,
  `related_id` bigint DEFAULT NULL,
  `related_type` varchar(50) DEFAULT NULL,
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `message`
--

LOCK TABLES `message` WRITE;
/*!40000 ALTER TABLE `message` DISABLE KEYS */;
INSERT INTO `message` VALUES (1,'新作业通知','您有一份新的作业《JavaEE第一次作业》已发布，请及时完成。','assignment',1,'assignment','2026-03-27 13:08:56'),(2,'批改完成通知','您的作业《JavaEE第一次作业》已批改，请查看反馈。','grading',1,'submission','2026-03-27 13:08:56'),(3,'课程添加通知','您已加入李老师的《JavaEE企业级应用开发》课程。','course',1,'course','2026-03-27 13:08:56'),(4,'课程添加通知','您已被添加到课程：Test Course','SYSTEM',NULL,NULL,'2026-03-27 17:01:35'),(5,'课程添加通知','您已被添加到课程：Spring Boot Development','SYSTEM',NULL,NULL,'2026-03-27 17:02:15'),(6,'课程移除通知','您已从课程：Spring Boot Development Updated 中移除','SYSTEM',NULL,NULL,'2026-03-27 17:02:43'),(7,'新作业通知','您有一份新的作业《Spring Boot Basics》已发布，请及时完成。','assignment',5,'assignment','2026-03-27 17:13:37'),(8,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已完成AI批改，得分：20分。请查看详细反馈，继续努力！','GRADING',4,'STUDENT','2026-03-28 08:08:29'),(9,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已完成AI批改，得分：40分。请查看详细反馈，继续努力！','GRADING',4,'STUDENT','2026-03-28 08:19:21'),(10,'课程移除通知','您已从课程：Web前端开发技术 中移除','SYSTEM',NULL,NULL,'2026-03-29 17:10:03'),(11,'课程移除通知','您已从课程：JavaEE企业级应用程序应用开发教程 中移除','SYSTEM',NULL,NULL,'2026-03-29 17:10:09'),(12,'作业删除通知','作业《Python基础语法练习》已被删除。','SYSTEM',NULL,NULL,'2026-03-30 07:37:47'),(13,'作业更新通知','作业《线代第一次课后作业》已更新，请查看最新内容。','assignment',7,'assignment','2026-03-31 04:02:49'),(14,'课程添加通知','你已加入王甲老师的Web前端开发技术课程','SYSTEM',NULL,NULL,'2026-04-01 06:41:20'),(15,'课程添加通知','你已加入王甲老师的JavaEE企业级应用程序应用开发教程课程','SYSTEM',NULL,NULL,'2026-04-01 06:43:13'),(16,'作业批改完成','您的作业「Web课后第二次作业」已完成AI批改，得分：0分。请查看详细反馈，继续努力！','GRADING',4,'STUDENT','2026-04-01 14:51:29'),(17,'作业打回重做','您的作业「Web课后第二次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-01 16:18:05'),(18,'作业打回重做','您的作业「网络分层与协议作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-01 16:20:05'),(19,'作业打回重做','您的作业「网络分层与协议作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-01 16:31:18'),(20,'作业打回重做','您的作业「网络分层与协议作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-01 16:40:44'),(21,'作业批改完成','您的作业「网络分层与协议作业」已完成AI批改，得分：100分。表现不错，继续保持！','GRADING',4,'STUDENT','2026-04-01 16:41:30'),(22,'作业打回重做','您的作业「Web课后第二次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-02 05:43:45'),(23,'作业批改完成','您的作业「Web课后第二次作业」已完成AI批改，得分：0分。请查看详细反馈，继续努力！','GRADING',4,'STUDENT','2026-04-02 05:44:37'),(24,'作业打回重做','您的作业「Web课后第二次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-02 11:26:36'),(25,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（请查看详细反馈），AI预评分：0分。主观题部分待教师复核后确定最终得分。','GRADING',4,'STUDENT','2026-04-02 11:28:37'),(26,'作业打回重做','您的作业「Web课后第二次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-02 12:31:34'),(27,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（请查看详细反馈），AI预评分：50分。主观题部分待教师复核后确定最终得分。','GRADING',4,'STUDENT','2026-04-02 12:32:41'),(28,'作业打回重做','您的作业「Web课后第二次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-02 12:34:26'),(29,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（表现不错），AI预评分：100分。主观题部分待教师复核后确定最终得分。','GRADING',4,'STUDENT','2026-04-02 12:35:07'),(30,'作业打回重做','您的作业「Web课后第二次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-02 15:46:44'),(31,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（表现不错），AI预评分：80分。主观题部分待教师复核后确定最终得分。','GRADING',4,'STUDENT','2026-04-02 15:48:02'),(32,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（请查看详细反馈），AI预评分：50分。主观题部分待教师复核后确定最终得分。','GRADING',12,'STUDENT','2026-04-03 05:27:08'),(33,'作业批改完成','您的作业「网络分层与协议作业」已自动批改完成，得分：100分。表现不错，继续保持！','GRADING',12,'STUDENT','2026-04-03 05:27:13'),(34,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：65分。主观题部分待教师复核后确定最终得分。','GRADING',12,'STUDENT','2026-04-03 05:31:03'),(35,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已自动批改完成，得分：80分。表现不错，继续保持！','GRADING',12,'STUDENT','2026-04-03 05:31:15'),(36,'作业AI预批改完成','您的作业「线代第一次课后作业」已完成AI预批改（请查看详细反馈），AI预评分：10分。主观题部分待教师复核后确定最终得分。','GRADING',12,'STUDENT','2026-04-03 05:32:25'),(37,'作业AI预批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已完成AI预批改（表现不错），AI预评分：76分。主观题部分待教师复核后确定最终得分。','GRADING',12,'STUDENT','2026-04-03 05:34:09'),(38,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（表现不错），AI预评分：95分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-03 05:53:08'),(39,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：83分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-03 05:55:30'),(40,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已自动批改完成，得分：100分。表现不错，继续保持！','GRADING',5,'STUDENT','2026-04-03 05:55:36'),(41,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：84分。表现不错，继续保持！','GRADING',5,'STUDENT','2026-04-03 05:56:07'),(42,'作业批改完成','您的作业「网络分层与协议作业」已自动批改完成，得分：100分。表现不错，继续保持！','GRADING',5,'STUDENT','2026-04-03 05:57:34'),(43,'作业AI预批改完成','您的作业「线代第一次课后作业」已完成AI预批改（请查看详细反馈），AI预评分：40分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-03 05:57:37'),(44,'作业打回重做','您的作业「线代第一次课后作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-03 07:37:26'),(45,'作业打回重做','您的作业「线代第一次课后作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-03 07:37:29'),(46,'作业更新通知','作业《线代第一次课后作业》已更新，请查看最新内容。','assignment',7,'assignment','2026-04-03 07:50:40'),(47,'作业AI预批改完成','您的作业「线代第一次课后作业」已完成AI预批改（表现不错），AI预评分：60分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-03 07:52:10'),(48,'作业打回重做','您的作业「线代第一次课后作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-03 11:07:49'),(49,'作业AI预批改完成','您的作业「线代第一次课后作业」已完成AI预批改（表现不错），AI预评分：60分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-03 11:08:18'),(50,'作业打回重做','您的作业「线代第一次课后作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-03 11:17:01'),(51,'作业打回重做','您的作业「Web课后第一次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-03 16:57:41'),(52,'作业打回重做','您的作业「Web课后第一次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-03 16:57:49'),(53,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：100分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-03 17:10:14'),(54,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（表现不错），AI预评分：90分。主观题部分待教师复核后确定最终得分。','GRADING',6,'STUDENT','2026-04-04 13:37:37'),(55,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：95分。主观题部分待教师复核后确定最终得分。','GRADING',6,'STUDENT','2026-04-04 13:42:55'),(56,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已自动批改完成，得分：80分。表现不错，继续保持！','GRADING',6,'STUDENT','2026-04-04 13:43:08'),(57,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：84分。表现不错，继续保持！','GRADING',6,'STUDENT','2026-04-04 13:43:30'),(58,'作业打回重做','您的作业「JavaEE第一次作业 - Servlet与JSP」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 13:52:21'),(59,'作业打回重做','您的作业「JavaEE第一次作业 - Servlet与JSP」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 13:52:25'),(60,'作业打回重做','您的作业「JavaEE第一次作业 - Servlet与JSP」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 13:52:28'),(61,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：94分。表现不错，继续保持！','GRADING',12,'STUDENT','2026-04-04 14:00:50'),(62,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：80分。主观题部分待教师复核后确定最终得分。','GRADING',12,'STUDENT','2026-04-04 14:01:12'),(63,'作业打回重做','您的作业「Web课后第一次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 14:29:26'),(64,'作业打回重做','您的作业「Web课后第一次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 14:29:29'),(65,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：95分。主观题部分待教师复核后确定最终得分。','GRADING',6,'STUDENT','2026-04-04 14:30:01'),(66,'作业AI预批改完成','您的作业「线代第一次课后作业」已完成AI预批改（表现不错），AI预评分：80分。主观题部分待教师复核后确定最终得分。','GRADING',6,'STUDENT','2026-04-04 14:30:52'),(67,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：84分。表现不错，继续保持！','GRADING',6,'STUDENT','2026-04-04 14:31:06'),(68,'作业打回重做','您的作业「JavaEE第一次作业 - Servlet与JSP」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 14:31:49'),(69,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：65分。表现不错，继续保持！','GRADING',6,'STUDENT','2026-04-04 14:36:09'),(70,'作业打回重做','您的作业「Web课后第一次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-04 14:47:42'),(71,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：95分。主观题部分待教师复核后确定最终得分。','GRADING',6,'STUDENT','2026-04-04 14:48:53'),(72,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：80分。主观题部分待教师复核后确定最终得分。','GRADING',12,'STUDENT','2026-04-04 15:03:55'),(73,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：90分。表现不错，继续保持！','GRADING',5,'STUDENT','2026-04-05 08:08:08'),(74,'作业AI预批改完成','您的作业「线代第一次课后作业」已完成AI预批改（表现不错），AI预评分：90分。主观题部分待教师复核后确定最终得分。','GRADING',5,'STUDENT','2026-04-05 08:08:30'),(75,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（表现不错），AI预评分：80分。主观题部分待教师复核后确定最终得分。','GRADING',14,'STUDENT','2026-04-06 12:47:24'),(76,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：100分。主观题部分待教师复核后确定最终得分。','GRADING',14,'STUDENT','2026-04-06 12:55:47'),(77,'作业打回重做','您的作业「Web课后第一次作业」已被教师打回，请重新提交。','system',NULL,NULL,'2026-04-06 12:57:01'),(78,'作业AI预批改完成','您的作业「Web课后第一次作业」已完成AI预批改（表现不错），AI预评分：100分。主观题部分待教师复核后确定最终得分。','GRADING',14,'STUDENT','2026-04-06 13:03:20'),(79,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已自动批改完成，得分：100分。表现不错，继续保持！','GRADING',14,'STUDENT','2026-04-06 13:03:35'),(80,'作业AI预批改完成','您的作业「Web课后第二次作业」已完成AI预批改（表现不错），AI预评分：100分。主观题部分待教师复核后确定最终得分。','GRADING',15,'STUDENT','2026-04-06 13:20:48'),(81,'作业批改完成','您的作业「JavaEE第二次作业 - MVC模式」已自动批改完成，得分：100分。表现不错，继续保持！','GRADING',15,'STUDENT','2026-04-06 13:20:59'),(82,'作业批改完成','您的作业「JavaEE第一次作业 - Servlet与JSP」已自动批改完成，得分：90分。表现不错，继续保持！','GRADING',15,'STUDENT','2026-04-06 13:21:18');
/*!40000 ALTER TABLE `message` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-04-07 18:06:03
